addons/l10n_my_ubl_pint/tests/expected_xmls/invoice_no_taxes.xml

<?xml version='1.0' encoding='UTF-8'?>
<Invoice xmlns="urn:oasis:names:specification:ubl:schema:xsd:Invoice-2" xmlns:cac="urn:oasis:names:specification:ubl:schema:xsd:CommonAggregateComponents-2" xmlns:cbc="urn:oasis:names:specification:ubl:schema:xsd:CommonBasicComponents-2">
  <cbc:CustomizationID>urn:peppol:pint:billing-1@my-1</cbc:CustomizationID>
  <cbc:ProfileID>urn:peppol:bis:billing</cbc:ProfileID>
  <cbc:ID>INV/2019/00001</cbc:ID>
  <cbc:IssueDate>2019-01-01</cbc:IssueDate>
  <cbc:DueDate>2019-01-01</cbc:DueDate>
  <cbc:InvoiceTypeCode>380</cbc:InvoiceTypeCode>
  <cbc:DocumentCurrencyCode>MYR</cbc:DocumentCurrencyCode>
  <cac:OrderReference>
    <cbc:ID>INV/2019/00001</cbc:ID>
  </cac:OrderReference>
  <cac:AccountingSupplierParty>
    <cac:Party>
      <cac:PartyName>
        <cbc:Name>company_1_data</cbc:Name>
      </cac:PartyName>
      <cac:PostalAddress>
        <cbc:StreetName>that one street, 5</cbc:StreetName>
        <cbc:CityName>Main city</cbc:CityName>
        <cbc:CountrySubentity>Johor</cbc:CountrySubentity>
        <cac:Country>
          <cbc:IdentificationCode>MY</cbc:IdentificationCode>
        </cac:Country>
      </cac:PostalAddress>
      <cac:PartyTaxScheme>
        <cbc:CompanyID>NA</cbc:CompanyID>
        <cac:TaxScheme>
          <cbc:ID>NOT_EU_VAT</cbc:ID>
        </cac:TaxScheme>
      </cac:PartyTaxScheme>
      <cac:PartyTaxScheme>
        <cbc:CompanyID>C2584563200</cbc:CompanyID>
        <cac:TaxScheme>
          <cbc:ID>GST</cbc:ID>
        </cac:TaxScheme>
      </cac:PartyTaxScheme>
      <cac:PartyLegalEntity>
        <cbc:RegistrationName>company_1_data</cbc:RegistrationName>
        <cbc:CompanyID>C2584563200</cbc:CompanyID>
      </cac:PartyLegalEntity>
      <cac:Contact>
        <cbc:Name>company_1_data</cbc:Name>
        <cbc:Telephone>+60123456789</cbc:Telephone>
      </cac:Contact>
    </cac:Party>
  </cac:AccountingSupplierParty>
  <cac:AccountingCustomerParty>
    <cac:Party>
      <cac:PartyName>
        <cbc:Name>partner_a</cbc:Name>
      </cac:PartyName>
      <cac:PostalAddress>
        <cbc:StreetName>that other street, 3</cbc:StreetName>
        <cbc:CityName>Main city</cbc:CityName>
        <cbc:CountrySubentity>Johor</cbc:CountrySubentity>
        <cac:Country>
          <cbc:IdentificationCode>MY</cbc:IdentificationCode>
        </cac:Country>
      </cac:PostalAddress>
      <cac:PartyTaxScheme>
        <cbc:CompanyID>NA</cbc:CompanyID>
        <cac:TaxScheme>
          <cbc:ID>NOT_EU_VAT</cbc:ID>
        </cac:TaxScheme>
      </cac:PartyTaxScheme>
      <cac:PartyLegalEntity>
        <cbc:RegistrationName>partner_a</cbc:RegistrationName>
        <cbc:CompanyID>C2584563201</cbc:CompanyID>
      </cac:PartyLegalEntity>
      <cac:Contact>
        <cbc:Name>partner_a</cbc:Name>
        <cbc:Telephone>+60123456786</cbc:Telephone>
      </cac:Contact>
    </cac:Party>
  </cac:AccountingCustomerParty>
  <cac:Delivery>
    <cac:DeliveryLocation>
      <cac:Address>
        <cbc:StreetName>that other street, 3</cbc:StreetName>
        <cbc:CityName>Main city</cbc:CityName>
        <cbc:CountrySubentity>Johor</cbc:CountrySubentity>
        <cac:Country>
          <cbc:IdentificationCode>MY</cbc:IdentificationCode>
        </cac:Country>
      </cac:Address>
    </cac:DeliveryLocation>
    <cac:DeliveryParty>
      <cac:PartyName>
        <cbc:Name>partner_a</cbc:Name>
      </cac:PartyName>
    </cac:DeliveryParty>
  </cac:Delivery>
  <cac:PaymentMeans>
    <cbc:PaymentMeansCode name="mutually defined">ZZZ</cbc:PaymentMeansCode>
    <cbc:PaymentID>INV/2019/00001</cbc:PaymentID>
  </cac:PaymentMeans>
  <cac:PaymentTerms>
    <cbc:Note>Payment terms: Immediate Payment</cbc:Note>
  </cac:PaymentTerms>
  <cac:TaxTotal>
    <cbc:TaxAmount currencyID="MYR">0.00</cbc:TaxAmount>
  </cac:TaxTotal>
  <cac:LegalMonetaryTotal>
    <cbc:LineExtensionAmount currencyID="MYR">1000.00</cbc:LineExtensionAmount>
    <cbc:TaxExclusiveAmount currencyID="MYR">0.00</cbc:TaxExclusiveAmount>
    <cbc:TaxInclusiveAmount currencyID="MYR">1000.00</cbc:TaxInclusiveAmount>
    <cbc:PrepaidAmount currencyID="MYR">0.00</cbc:PrepaidAmount>
    <cbc:PayableAmount currencyID="MYR">1000.00</cbc:PayableAmount>
  </cac:LegalMonetaryTotal>
  <cac:InvoiceLine>
    <cbc:ID>1</cbc:ID>
    <cbc:InvoicedQuantity unitCode="C62">1.0</cbc:InvoicedQuantity>
    <cbc:LineExtensionAmount currencyID="MYR">1000.00</cbc:LineExtensionAmount>
    <cac:Item>
      <cbc:Description>product_a</cbc:Description>
      <cbc:Name>product_a</cbc:Name>
    </cac:Item>
    <cac:Price>
      <cbc:PriceAmount currencyID="MYR">1000.0</cbc:PriceAmount>
    </cac:Price>
  </cac:InvoiceLine>
</Invoice>
